guestRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://localhost:8080/webservice">
<soapenv:Header/>
<soapenv:Body>
   <us:getGuestRequest>
       <us:name>Joseph</us:name>
   </us:getGuestRequest>
</soapenv:Body>
</soapenv:Envelope>